Revit 2026 API

# InsulationTypeSetForwardIterator Method

---

Retrieve a forward moving iterator to the set.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual InsulationTypeSetIterator ForwardIterator()
```
```vb
Public Overridable Function ForwardIterator As InsulationTypeSetIterator
```
```cpp
public:
virtual InsulationTypeSetIterator^ ForwardIterator()
```
```fsharp
abstract ForwardIterator : unit -> InsulationTypeSetIterator
override ForwardIterator : unit -> InsulationTypeSetIterator
```

#### Return Value

InsulationTypeSetIteratorReturns a forward moving iterator to the set.

#### Reference

InsulationTypeSet Class

Autodesk.Revit.DB.Electrical Namespace